; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-4-3-8)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	s0 - location
	s1 - location
	s2 - location
	p0-1 - location
	p0-2 - location
	p1-0 - location
	p2-1 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s0)
	(at driver3 s0)
	(at driver4 s0)
	(at truck1 s1)
	(empty truck1)
	(at truck2 s1)
	(empty truck2)
	(at truck3 s1)
	(empty truck3)
	(at package1 s2)
	(at package2 s1)
	(at package3 s0)
	(at package4 s1)
	(at package5 s2)
	(at package6 s1)
	(at package7 s2)
	(at package8 s0)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(= (time-to-walk s0 p0-1) 28)
	(= (time-to-walk p0-1 s0) 28)
	(= (time-to-walk s1 p0-1) 59)
	(= (time-to-walk p0-1 s1) 59)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(= (time-to-walk s0 p0-2) 9)
	(= (time-to-walk p0-2 s0) 9)
	(= (time-to-walk s2 p0-2) 68)
	(= (time-to-walk p0-2 s2) 68)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(= (time-to-walk s2 p2-1) 98)
	(= (time-to-walk p2-1 s2) 98)
	(= (time-to-walk s1 p2-1) 83)
	(= (time-to-walk p2-1 s1) 83)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 64)
	(= (time-to-drive s1 s0) 64)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 68)
	(= (time-to-drive s2 s0) 68)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 56)
	(= (time-to-drive s1 s2) 56)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver2 s2)
	(at driver3 s1)
	(at driver4 s0)
	(at truck2 s0)
	(at truck3 s2)
	(at package1 s2)
	(at package2 s0)
	(at package4 s0)
	(at package5 s0)
	(at package6 s1)
	(at package7 s1)
	))

(:metric minimize (+ (+ (* 4  (total-time)) (* 2  (driven))) (* 4  (walked))))

)

; plan
1. (walk driver3 s0 p0-1)
   deleted: (at driver3 s0)
   added: (at driver3 p0-1)
   changed: (walked) from 0 to 28
   goals met: 3 of 11
2. (walk driver3 p0-1 s1)
   deleted: (at driver3 p0-1)
   added: (at driver3 s1)
   changed: (walked) from 28 to 87
   goals met: 4 of 11
3. (board-truck driver3 truck2 s1)
   deleted: (at driver3 s1) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 3 of 11
4. (walk driver2 s0 p0-2)
   deleted: (at driver2 s0)
   added: (at driver2 p0-2)
   changed: (walked) from 87 to 96
   goals met: 3 of 11
5. (load-truck package2 truck2 s1)
   deleted: (at package2 s1)
   added: (in package2 truck2)
   goals met: 3 of 11
6. (load-truck package4 truck2 s1)
   deleted: (at package4 s1)
   added: (in package4 truck2)
   goals met: 3 of 11
7. (drive-truck truck2 s1 s2 driver3)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   changed: (driven) from 0 to 56
   goals met: 3 of 11
8. (load-truck package5 truck2 s2)
   deleted: (at package5 s2)
   added: (in package5 truck2)
   goals met: 3 of 11
9. (walk driver2 p0-2 s2)
   deleted: (at driver2 p0-2)
   added: (at driver2 s2)
   changed: (walked) from 96 to 164
   goals met: 4 of 11
10. (load-truck package7 truck2 s2)
   deleted: (at package7 s2)
   added: (in package7 truck2)
   goals met: 4 of 11
11. (drive-truck truck2 s2 s1 driver3)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   changed: (driven) from 56 to 112
   goals met: 4 of 11
12. (unload-truck package7 truck2 s1)
   deleted: (in package7 truck2)
   added: (at package7 s1)
   goals met: 5 of 11
13. (drive-truck truck2 s1 s0 driver3)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   changed: (driven) from 112 to 176
   goals met: 6 of 11
14. (unload-truck package2 truck2 s0)
   deleted: (in package2 truck2)
   added: (at package2 s0)
   goals met: 7 of 11
15. (unload-truck package5 truck2 s0)
   deleted: (in package5 truck2)
   added: (at package5 s0)
   goals met: 8 of 11
16. (walk driver2 s2 p2-1)
   deleted: (at driver2 s2)
   added: (at driver2 p2-1)
   changed: (walked) from 164 to 262
   goals met: 7 of 11
17. (walk driver2 p2-1 s1)
   deleted: (at driver2 p2-1)
   added: (at driver2 s1)
   changed: (walked) from 262 to 345
   goals met: 7 of 11
18. (board-truck driver2 truck3 s1)
   deleted: (at driver2 s1) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 7 of 11
19. (drive-truck truck3 s1 s2 driver2)
   deleted: (at truck3 s1)
   added: (at truck3 s2)
   changed: (driven) from 176 to 232
   goals met: 8 of 11
20. (disembark-truck driver2 truck3 s2)
   deleted: (driving driver2 truck3)
   added: (at driver2 s2) (empty truck3)
   goals met: 9 of 11
21. (drive-truck truck2 s0 s1 driver3)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   changed: (driven) from 232 to 296
   goals met: 8 of 11
22. (disembark-truck driver3 truck2 s1)
   deleted: (driving driver3 truck2)
   added: (at driver3 s1) (empty truck2)
   goals met: 9 of 11
23. (unload-truck package4 truck2 s1)
   deleted: (in package4 truck2)
   added: (at package4 s1)
   goals met: 9 of 11
24. (board-truck driver3 truck1 s1)
   deleted: (at driver3 s1) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 8 of 11
25. (load-truck package4 truck1 s1)
   deleted: (at package4 s1)
   added: (in package4 truck1)
   goals met: 8 of 11
26. (drive-truck truck1 s1 s0 driver3)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   changed: (driven) from 296 to 360
   goals met: 8 of 11
27. (unload-truck package4 truck1 s0)
   deleted: (in package4 truck1)
   added: (at package4 s0)
   goals met: 9 of 11
28. (walk driver2 s2 p2-1)
   deleted: (at driver2 s2)
   added: (at driver2 p2-1)
   changed: (walked) from 345 to 443
   goals met: 8 of 11
29. (walk driver2 p2-1 s1)
   deleted: (at driver2 p2-1)
   added: (at driver2 s1)
   changed: (walked) from 443 to 526
   goals met: 8 of 11
30. (drive-truck truck1 s0 s1 driver3)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   changed: (driven) from 360 to 424
   goals met: 8 of 11
31. (disembark-truck driver3 truck1 s1)
   deleted: (driving driver3 truck1)
   added: (at driver3 s1) (empty truck1)
   goals met: 9 of 11
32. (board-truck driver2 truck2 s1)
   deleted: (at driver2 s1) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 9 of 11
33. (drive-truck truck2 s1 s2 driver2)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   changed: (driven) from 424 to 480
   goals met: 9 of 11
34. (disembark-truck driver2 truck2 s2)
   deleted: (driving driver2 truck2)
   added: (at driver2 s2) (empty truck2)
   goals met: 10 of 11
35. (board-truck driver1 truck2 s2)
   deleted: (at driver1 s2) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 10 of 11
36. (drive-truck truck2 s2 s0 driver1)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   changed: (driven) from 480 to 548
   goals met: 11 of 11
